major_db = ['วิศวกรรมเครื่องกล', 'วิศวกรรมอุตสาหการ', 'วิศวกรรมไฟฟ้า',
       'วิศวกรรมเหมืองแร่', 'วิศวกรรมโยธา', 'วิศวกรรมเคมี',
       'วิศวกรรมเมคาทรอนิกส์', 'วิศวกรรมวัสดุ',
       'วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมการผลิต', 'วิศวกรรมชีวการแพทย์',
       'วิศวกรรมสิ่งแวดล้อม', 'วิศวกรรมและการจัดการนวัตกรรม',
       'วิศวกรรมเหมืองแร่และวัสดุ', 'วิศวกรรมปัญญาประดิษฐ์']

major_id_db = [215., 225., 210., 235., 220., 230., 216., 250., 200., 240., 226.,
       214., 205., 203., 254., 204.,]

dept_db = ['ภาควิชาวิศวกรรมเครื่องกล', 'ภาควิชาวิศวกรรมอุตสาหการ',
       'ภาควิชาวิศวกรรมไฟฟ้า', 'ภาควิชาวิศวกรรมเหมืองแร่และวัสดุ',
       'ภาควิชาวิศวกรรมโยธา', 'ภาควิชาวิศวกรรมเคมี', 'คณะวิศวกรรมศาสตร์',
       'ภาควิชาวิศวกรรมคอมพิวเตอร์']

dept_id_db = [30.,  31.,  28.,  33.,  29.,  32., 193.,  34.,]

degree_id_db = [218., 228., 213., 240., 223., 233., 242., 238., 243., 239.,
       211., 245., 254., 149., 252.]

def getMajors():
    return major_db

def getDepts():
    return dept_db

def checkMajorId(item):
    n = major_db.index(item)
    id = major_id_db[n]
    return id

def checkDeptId(item):
    n = dept_db.index(item)
    id = dept_id_db[n]
    return id

def checkDegreeId(item):
    n = major_db.index(item)
    id = degree_id_db[n]
    return id