major_db = ['วิศวกรรมเครื่องกล', 'วิศวกรรมอุตสาหการ', 'วิศวกรรมไฟฟ้า',
       'วิศวกรรมเหมืองแร่', 'วิศวกรรมโยธา', 'วิศวกรรมเคมี',
       'วิศวกรรมเมคาทรอนิกส์', 'วิศวกรรมวัสดุ', 'ยังไม่แยกสาขาวิชา',
       'วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมการผลิต', 'วิศวกรรมชีวการแพทย์',
       'วิศวกรรมสิ่งแวดล้อม', 'วิศวกรรมและการจัดการนวัตกรรม',
       'วิศวกรรมเหมืองแร่และวัสดุ', 'วิศวกรรมปัญญาประดิษฐ์']

major_id_db = ['0215', '0225', '0210', '0235', '0220', '0230', '0216', '0250',
       '0200', '0240', '0226', '0214', '0205', '0203', '0254', '0204']

dept_db = ['ภาควิชาวิศวกรรมเครื่องกล', 'ภาควิชาวิศวกรรมอุตสาหการ',
       'ภาควิชาวิศวกรรมไฟฟ้า', 'ภาควิชาวิศวกรรมเหมืองแร่และวัสดุ',
       'ภาควิชาวิศวกรรมโยธา', 'ภาควิชาวิศวกรรมเคมี', 'คณะวิศวกรรมศาสตร์',
       'ภาควิชาวิศวกรรมคอมพิวเตอร์']

dept_id_db = ['030', '031', '028', '033', '029', '032', '193', '034']

def getMajors():
    return major_db

def getDepts():
    return dept_db

def checkMajorId(item):
    n = major_db.index(item)
    id = major_id_db[n]
    return id

def checkDeptId(item):
    n = dept_db.index(item)
    id = dept_id_db[n]
    return id